entries/archive.org
#+hugo_base_dir: ../
#+startup: content
#+macro: latex @@html:<span class="latex">L<sup>A</sup>T<sub>E</sub>X</span>@@
#+options: ^:{}
#+macro: srclink (eval (org-hugo-get-link-to-orgfile "https://github.com/takaxp/blog/blame/master/entries/" "see Orgfile"))

** DONE リンクの内容をeldocで表示                                    :@emacs:
   CLOSED: [2019-10-01 Tue 22:06]
:PROPERTIES:
:EXPORT_FILE_NAME: a7ef3cd5-df52-2004-db2b-03d36ef48555
:EXPORT_HUGO_TAGS: "orgmode" "eldoc" "org-link"
:EXPORT_HUGO_LASTMOD: [2019-11-19 Tue 10:30]
:EXPORT_HUGO_IMAGES: 
:ID:       88DE0FE1-E266-44FB-8E4E-DFE3967E8831
:CREATED:  [2019-10-01 Tue 22:03]
:END:

=eldoc= の機能を用いてカーソル下のリンクをエコーエリアに出す設定です．意外と簡単にできました．

#+begin_src emacs-lisp
(with-eval-after-load "org"
  (add-hook 'org-mode-hook #'my-load-echo-org-link)

  (defun my-echo-org-link ()
    (when (org-in-regexp org-link-bracket-re 1)
      (let ((link "Link:")
            (msg (org-link-unescape (match-string-no-properties 1))))
        (put-text-property 0 (length link) 'face 'minibuffer-prompt link)
        (eldoc-message (format "%s %s" link msg)))))

  ;; これはダメな例
  ;; (defun my-load-echo-org-link ()
  ;;   (setq-local eldoc-documentation-function #'my-echo-org-link))
  ;; こちらが正しい実装
  (defun my-load-echo-org-link ()
    (add-function :before-until (local 'eldoc-documentation-function)
                  #'my-echo-org-link)))
#+end_src

なお， ~org-eldoc~ と併用する場合， =eldoc-documentation-function= が専有されてしまうので，次のように =advice= して回避します．

#+begin_src emacs-lisp
(when (require 'org-eldoc nil t)
  (defun my-org-eldoc-load ()
    "Set up org-eldoc documentation function."
    (interactive)
    (add-function :before-until (local 'eldoc-documentation-function)
                  #'org-eldoc-documentation-function))
  (advice-add 'org-eldoc-load :override #'my-org-eldoc-load))
#+end_src

*** Updates
 - [2019-11-19 Tue] =my-load-echo-org-link= の実装を修正
